<?php
/**
 * russian.php
 * Файл локализации плагина Rating
 *
 * @author      Андрей Воронов <andreyv@gladcode.ru>
 *              Является частью плагина Rating
 * @version     0.0.1 от 30.01.2015 15:45
 */
return array(

    'admin_title'                    => 'Система рейтинга (простой вариант)',
    'save'                           => 'Сохранить',
    'cancel'                         => 'Отменить',

    'rating_enabled'                 => 'Включить систему рейтинга',

    'personal_recalc'                => 'Коэфициенты для пересчёта рейтингов персональных блогов',
    'topic_rating_sum'               => 'Коэфициент для суммы всех рейтингов топиков блога',
    'count_topic'                    => 'Коэфициент для количества топиков',

    'acl_vote_user_rating_notice'    => 'Голосование за пользователя',
    'acl_vote_blog_rating_notice'    => 'Голосование за блог',
    'acl_vote_topic_rating_notice'   => 'Голосование за топик',
    'acl_vote_comment_rating_notice' => 'Голосование за комментарий',
    'acl_vote'                       => 'Нижний порог рейтинга для голосования (пользователи с меньшим рейтингом голосовать не смогут)',

    'user_notice'                    => 'Коэфициенты, показывающие на сколько баллов будет уменьшаться рейтинг голосующего и увеличиваться рейтинг того пользователя, за которого голосуют',
    'user_remove'                    => 'Изменение баллов у госующего',
    'user_add'                       => 'Изменение баллов пользователя, за которого голосуют',

    'comment_notice'                 => 'Коэфициенты, показывающие на сколько баллов будет уменьшаться рейтинг голосующего и увеличиваться рейтинг того пользователя при голосовании за его комментарий',
    'comment_user_remove'            => 'Изменение баллов у госующего',
    'comment_user_add'               => 'Изменение баллов пользователя',

    'blog_notice'                    => 'Коэфициенты, показывающие на сколько баллов будет уменьшаться рейтинг голосующего и увеличиваться рейтинг блога, за который голосуют',
    'blog_user_remove'               => 'Изменение баллов у госующего',
    'blog_add'                       => 'Изменение баллов блога',

    'topic_notice'                   => 'Коэфициенты, показывающие на сколько баллов будет уменьшаться рейтинг голосующего и увеличиваться рейтинг топика и пользователя при голосовании за топик',
    'topic_user_remove'              => 'Изменение баллов у госующего',
    'topic_user_add'                 => 'Изменение баллов пользователя',
    'topic_add'                      => 'Количество начисляемых баллов топику',

);